#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_ami.amazon_ami: Reading...
aws_cloudwatch_log_group.cw_loggroup: Refreshing state... [id=app-3-log-group]
data.aws_availability_zones.available: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0fe396638c82e7296]
data.aws_iam_policy_document.assume_role: Reading...
aws_eip.nat_gateway[1]: Refreshing state... [id=eipalloc-0fb7874b82a113ac8]
aws_eip.nat_gateway[0]: Refreshing state... [id=eipalloc-0b04b463d3c3463c6]
aws_eip.nat_gateway[2]: Refreshing state... [id=eipalloc-04c73c9624828aee9]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2717921857]
aws_iam_role.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role]
data.aws_availability_zones.available: Read complete after 1s [id=us-east-2]
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3756711811]
data.aws_ami.amazon_ami: Read complete after 1s [id=ami-0ec5c7d8262c1f6b2]
aws_iam_role_policy.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role:vpc_flowlog_role]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-0d158f17beea4776a]
aws_subnet.private[0]: Refreshing state... [id=subnet-037d475db5e25b4ee]
aws_route_table.private[0]: Refreshing state... [id=rtb-0a3cf88647a44f5cd]
aws_route_table.private[1]: Refreshing state... [id=rtb-01c78baaa3c4e6200]
aws_subnet.public[0]: Refreshing state... [id=subnet-0e32d6cdf608ddced]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-3-front/ade668808a2abb08]
aws_flow_log.app1: Refreshing state... [id=fl-0509ee9b3d612e45c]
aws_subnet.public[2]: Refreshing state... [id=subnet-06edf880f07807b14]
aws_subnet.public[1]: Refreshing state... [id=subnet-07be201bb398a1f34]
aws_route_table.private[2]: Refreshing state... [id=rtb-0b9a6a4d986bad5a5]
aws_subnet.private[1]: Refreshing state... [id=subnet-0e83aa1cb2d02a303]
aws_subnet.private[2]: Refreshing state... [id=subnet-00e8bb70a05a5436e]
aws_security_group.asg_lb_security_group: Refreshing state... [id=sg-011d6a82a8931221a]
aws_route_table.public: Refreshing state... [id=rtb-06df251e96e16e90d]
aws_default_security_group.default: Refreshing state... [id=sg-022994ca475c701c3]
aws_nat_gateway.public[1]: Refreshing state... [id=nat-07854500f74a63989]
aws_nat_gateway.public[2]: Refreshing state... [id=nat-0fc38e0244f89cf57]
aws_nat_gateway.public[0]: Refreshing state... [id=nat-0f3ce1a68458ff0d7]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0bcf83545bdf2357b]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0da7dff710879e827]
aws_route.internet-route: Refreshing state... [id=r-rtb-06df251e96e16e90d1080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00d0c353403f95517]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0e2bbccdc9e35841e]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0a8f52cef9af93d08]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-0f7f731e8772487be]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-077b356ce035ab1fa]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-0a3cf88647a44f5cd1080289494]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/app-3/e4bafdbd1e6b5ff7]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-01c78baaa3c4e62001080289494]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-0b9a6a4d986bad5a51080289494]
aws_launch_template.application: Refreshing state... [id=lt-048a41384c19faa77]
aws_autoscaling_group.application: Refreshing state... [id=app-3]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/app-3/e4bafdbd1e6b5ff7/1ac05262cf3271d0]
aws_autoscaling_policy.asg_policy_down: Refreshing state... [id=asg_policy_down]
aws_autoscaling_attachment.attach-app: Refreshing state... [id=app-3-20230822205921219300000001]
aws_autoscaling_policy.asg_policy_up: Refreshing state... [id=asg_policy_up]
aws_cloudwatch_metric_alarm.asg_cpu_alarm_down: Refreshing state... [id=asg_cpu_alarm_down]
aws_cloudwatch_metric_alarm.asg_cpu_alarm_up: Refreshing state... [id=asg_cpu_alarm_up]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_autoscaling_group.application will be updated in-place
  ~ resource "aws_autoscaling_group" "application" {
        id                        = "app-3"
        name                      = "app-3"
      ~ target_group_arns         = [
          - "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-3-front/ade668808a2abb08",
        ]
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_iam_instance_profile.ec2_profile will be created
  + resource "aws_iam_instance_profile" "ec2_profile" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = "ec2_profile"
      + name_prefix = (known after apply)
      + path        = "/"
      + role        = "ec2_role"
      + tags_all    = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + unique_id   = (known after apply)
    }

  # aws_iam_role.ec2_role will be created
  + resource "aws_iam_role" "ec2_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ec2_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-asg-elb-terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.custom will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "ec2_role"
    }

  # aws_launch_template.application will be updated in-place
  ~ resource "aws_launch_template" "application" {
        id                      = "lt-048a41384c19faa77"
      ~ latest_version          = 1 -> (known after apply)
        name                    = "terraform-20230822204818379500000005"
        tags                    = {}
      ~ user_data               = "IyEvYmluL2Jhc2gNCnN1ZG8gc3UNCnl1bSB1cGRhdGUgLXkNCnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NA0KeXVtIGluc3RhbGwgLXkganENClJFR0lPTl9BVl9aT05FPWBjdXJsIC1zIGh0dHA6Ly8xNjkuMjU0LjE2OS4yNTQvbGF0ZXN0L2R5bmFtaWMvaW5zdGFuY2UtaWRlbnRpdHkvZG9jdW1lbnQgfCBqcSAuYXZhaWxhYmlsaXR5Wm9uZSAtcmANCnN5c3RlbWN0bCBzdGFydCBodHRwZC5zZXJ2aWNlDQpzeXN0ZW1jdGwgZW5hYmxlIGh0dHBkLnNlcnZpY2UNCmVjaG8g4oCcSGVsbG8gV29ybGQgZnJvbSAkKGhvc3RuYW1lIC1mKSBmcm9tIHRoZSBhdmFpbGFiaWxpdHkgem9uZTogJFJFR0lPTl9BVl9aT05F4oCdID4gL3Zhci93d3cvaHRtbC9pbmRleC5odG1s" -> "IyEvYmluL2Jhc2gKc3VkbyBzdQp5dW0gdXBkYXRlIC15Cnl1bSBpbnN0YWxsIC15IGh0dHBkLng4Nl82NAp5dW0gaW5zdGFsbCAteSBqcQpSRUdJT05fQVZfWk9ORT1gY3VybCAtcyBodHRwOi8vMTY5LjI1NC4xNjkuMjU0L2xhdGVzdC9keW5hbWljL2luc3RhbmNlLWlkZW50aXR5L2RvY3VtZW50IHwganEgLmF2YWlsYWJpbGl0eVpvbmUgLXJgCnN5c3RlbWN0bCBzdGFydCBodHRwZC5zZXJ2aWNlCnN5c3RlbWN0bCBlbmFibGUgaHR0cGQuc2VydmljZQplY2hvIOKAnEhlbGxvIFdvcmxkIGZyb20gJChob3N0bmFtZSAtZikgZnJvbSB0aGUgYXZhaWxhYmlsaXR5IHpvbmU6ICRSRUdJT05fQVZfWk9OReKAnSA+IC92YXIvd3d3L2h0bWwvaW5kZXguaHRtbA=="
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group.front will be updated in-place
  ~ resource "aws_lb_target_group" "front" {
        id                                 = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/app-3-front/ade668808a2abb08"
        name                               = "app-3-front"
        tags                               = {}
        # (16 unchanged attributes hidden)

      ~ health_check {
          ~ path                = "/var/www/html/index.html" -> "/"
            # (8 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_route.private-route[0] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-0f3ce1a68458ff0d7"
        id                     = "r-rtb-0a3cf88647a44f5cd1080289494"
      - nat_gateway_id         = "nat-0f3ce1a68458ff0d7" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[1] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-07854500f74a63989"
        id                     = "r-rtb-01c78baaa3c4e62001080289494"
      - nat_gateway_id         = "nat-07854500f74a63989" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_route.private-route[2] will be updated in-place
  ~ resource "aws_route" "private-route" {
      + gateway_id             = "nat-0fc38e0244f89cf57"
        id                     = "r-rtb-0b9a6a4d986bad5a51080289494"
      - nat_gateway_id         = "nat-0fc38e0244f89cf57" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*